{
  "11": {
    "name": "乾为天",
    "fortune": "财运：名利双收，积少成多。",
    "lines": ["初爻：潜龙勿用，财运尚早，宜静待机会。", "二爻：见龙在田，财运初现，有贵人扶持。", "三爻：终日乾乾，辛苦经营，虽累但有收获。", "四爻：或跃在渊，机会就在眼前，看准时机操作。", "五爻：飞龙在天，财运亨通，是收获的大好时机。", "上爻：亢龙有悔，盈不可久，建议高位套现。"]
  },
  "88": {
    "name": "坤为地",
    "fortune": "财运：柔顺伸展，囤积货品，后有高价。",
    "lines": ["初爻：履霜坚冰至，警惕行情转冷。", "二爻：直方大，不习无不利，顺势而为必有收获。", "三爻：含章可贞，不宜张扬，低调建仓。", "四爻：括囊，无咎无誉，财运闭塞。", "五爻：黄裳元吉，大吉大利，正财运稳健。", "上爻：龙战于野，激烈博弈，小心亏损。"]
  },
  "63": {
    "name": "水火既济",
    "fortune": "财运：盛极将衰，应见好就收，预防回落。",
    "lines": ["初爻：曳其轮，濡其尾，见好就收无大碍。", "二爻：妇丧其茀，勿逐，丢失小利不要急于追回。", "三爻：高宗伐鬼方，长期抗战，要有耐心。", "四爻：繻有衣袽，警惕突发性的暴跌风险。", "五爻：东邻杀牛，不如西邻之禴祭，实利重于形式。", "上爻：濡其首，厉，行情已到尽头，极其危险。"]
  },
  "36": {
    "name": "火水未济",
    "fortune": "财运：事业未竟，曙光初现，仍需谨慎操作。",
    "lines": ["初爻：濡其尾，吝，仓促入市会有小麻烦。", "二爻：曳其轮，贞吉，持股不动反而有利。", "三爻：未济，征凶，此时不宜大举进攻。", "四爻：贞吉，悔亡，震用伐鬼方，大干一场的时机到了。", "五爻：贞吉，无悔，君子之光，财运步入正轨。", "上爻：有孚于饮酒，无咎，成功就在眼前，但切莫贪杯。"]
  },
  "18": {
    "name": "天地否",
    "fortune": "财运：闭塞不通，暂宜守成，不宜大举投资。",
    "lines": ["初爻：拔茅茹，应联防风险，减少仓位。", "二爻：大人否亨，财运不顺，适合保守。", "三爻：包羞，操作失误，应及时反省。", "四爻：有命无咎，志同道合，转机将至。", "五爻：休否，大人吉，阻力消失，行情好转。", "上爻：倾否，先否后喜，黑暗即将过去。"]
  },
  "81": {
    "name": "地天泰",
    "fortune": "财运：应时而变，入账丰厚，好运连连。",
    "lines": ["初爻：拔茅茹，以其汇，适合顺势加仓。", "二爻：包荒，用冯河，财气广大，容纳波动。", "三爻：无平不陂，无往不复，警惕牛市调整。", "四爻：翩翩不富以其邻，财运由盛转平。", "五爻：帝乙归妹，以祉元吉，会有意外之财。", "上爻：城复于隍，勿用师，运势已尽，切莫追高。"]
  },
  "64": {
    "name": "水雷屯",
    "fortune": "财运：起始维艰，虽然困难，但前景看好。",
    "lines": ["初爻：盘桓，利居贞，初期波动大，宜守不宜进。", "二爻：屯如邅如，进展缓慢，耐心等待。", "三爻：即鹿无虞，盲目跟风会有危险。", "四爻：求婚媾，往吉，寻找合作伙伴或利好信息。", "五爻：屯其膏，小贞吉，小额投资可见利。", "上爻：乘马班如，泣血涟如，环境恶劣，暂时离场。"]
  },
  "76": {
    "name": "山水蒙",
    "fortune": "财运：启蒙奋发，需向长辈或专业人士请教。",
    "lines": ["初爻：发蒙，利用刑人，需严格遵守交易纪律。", "二爻：包蒙吉，纳妇吉，财运平稳，包容波动。", "三爻：勿用取女，不要被表面的利好诱惑。", "四爻：困蒙，吝，因信息匮乏而陷入困境。", "五爻：童蒙吉，保持谦虚好学的态度则吉。", "上爻：击蒙，不利为寇，防范因过激操作导致亏损。"]
  },
  "61": {
    "name": "水天需",
    "fortune": "财运：守正待机，财运未到，需耐心等待。",
    "lines": ["初爻：需于郊，利用恒，远期的机会，长线持有。", "二爻：需于沙，小有言，终吉，会有小道消息干扰，不理会。", "三爻：需于泥，致寇至，环境恶化，小心被套。", "四爻：需于血，出自穴，陷入险境后有望脱身。", "五爻：需于酒食，贞吉，目前的收益足以支撑生活。", "上爻：入于穴，有不速之客三人来，意外转机出现。"]
  },
  "16": {
    "name": "天水讼",
    "fortune": "财运：慎争戒讼，容易产生合同纠纷或经济争端。",
    "lines": ["初爻：不永所事，小有言，纠纷很快过去。", "二爻：不克讼，归而逋，不宜硬拼，及早止损避险。", "三爻：食旧德，贞厉，守住老本，不宜开拓新业务。", "四爻：不克讼，复即命，放弃争执，回归理性则吉。", "五爻：讼元吉，能在经济纠纷中获胜。", "上爻：或锡之鞶带，三褫之，靠争斗得财，最终也会失去。"]
  },
  "86": {
    "name": "地水师",
    "fortune": "财运：行险而顺，需靠团队力量或大规模资金操作。",
    "lines": ["初爻：师出以律，必须严格执行投资计划。", "二爻：在师中吉，财运在掌控之中，会有重任。", "三爻：师或舆尸，凶，操作失误，损失惨重。", "四爻：师左次，无咎，暂时撤退以保全实力。", "五爻：长子帅师，由经验丰富的人决策则吉。", "上爻：大君有命，开国承家，大局已定，功成身退。"]
  },
  "68": {
    "name": "水地比",
    "fortune": "财运：诚信团结，利于合伙经营，众人拾柴。",
    "lines": ["初爻：有孚比之，无咎，诚信是获利的基础。", "二爻：比之自内，贞吉，内部关系和谐，利于生财。", "三爻：比之匪人，小心选错合作对象或垃圾股。", "四爻：外比之，贞吉，寻求外部支持或国际市场。", "五爻：显比，王用三驱，去留随缘，财运亨通。", "上爻：比之无首，凶，失去领导者或方向，财运尽。"]
  },
  "51": {
    "name": "风天小畜",
    "fortune": "财运：蓄养待进，力量尚小，虽有积蓄但不多。",
    "lines": ["初爻：复自道，何其咎，回归原始计划则吉。", "二爻：牵复吉，与他人共同进退，财运平稳。", "三爻：舆说辐，夫妻反目，防范内部矛盾导致财散。", "四爻：有孚，血去惕出，化险为夷，保住资本。", "五爻：有孚挛如，富以其邻，财运好，带动周边。", "上爻：既雨既处，尚德载，目标已达成，应停止扩张。"]
  },
  "12": {
    "name": "天泽履",
    "fortune": "财运：脚踏实地，如履薄冰，需格外小心操作。",
    "lines": ["初爻：素履往，无咎，按部就班，简单投资即可。", "二爻：履道坦坦，安静守正，财运稳健。", "三爻：眇能视，跛能履，实力不足却强行入市，凶。", "四爻：履虎尾，愬愬终吉，过程惊险，但结果不错。", "五爻：夬履，贞厉，决策虽然果断，但仍有风险。", "上爻：视履考祥，其旋元吉，总结经验，大获全胜。"]
  },
  "13": {
    "name": "天火同人",
    "fortune": "财运：上下和同，利于集资或跨界合作。",
    "lines": ["初爻：同人于门，无咎，公开公正的投资则吉。", "二爻：同人于宗，吝，局限于小圈子会错失良机。", "三爻：伏戎于莽，财运受阻，防范暗中对手。", "四爻：乘其墉，弗克攻，想进攻实力不足，无功而返。", "五爻：同人先号啕而后笑，历经磨难终获利。", "上爻：同人于郊，无悔，在边缘地带寻求机会。"]
  },
  "31": {
    "name": "火天大有",
    "fortune": "财运：顺天依时，大获丰收，财源广进。",
    "lines": ["初爻：无交害，匪咎，不参与非法集资则无害。", "二爻：大车以载，积蓄丰厚，资产配置稳健。", "三爻：公用亨于天子，利于大项目或公家财。", "四爻：匪其彭，无咎，不过分炫耀财富则吉。", "五爻：厥孚交如，信义获利，财运长久。", "上爻：自天佑之，吉无不利，财运极佳。"]
  },
  "87": {
    "name": "地山谦",
    "fortune": "财运：内高外低，低调生财，不宜张扬。",
    "lines": ["初爻：谦谦君子，用涉大川，适合处理复杂财务。", "二爻：鸣谦，贞吉，名气带来财运。", "三爻：劳谦君子，辛苦得财，能守住成果。", "四爻：无不利，㧑谦，灵活调度资金。", "五爻：利用侵伐，适当的竞争反而有利。", "上爻：鸣谦，利用行师，财运虽好也要防风险。"]
  },
  "48": {
    "name": "雷地豫",
    "fortune": "财运：顺时依势，顺心遂意，有意外之喜。",
    "lines": ["初爻：鸣豫，凶，得意忘形会导致损失。", "二爻：介于石，不终日，见机极快，获利即走。", "三爻：盱豫，悔，观望等待，错失良机。", "四爻：由豫，大有得，财源的主力，大获全胜。", "五爻：贞疾，恒不死，财运受阻但不会亏本。", "上爻：冥豫，成有渝，在昏暗中觉醒，及时止损。"]
  },
  "24": {
    "name": "泽雷随",
    "fortune": "财运：随时变通，跟随大盘走势，切莫逆市。",
    "lines": ["初爻：官有渝，贞吉，出门交有功，会有新项目。", "二爻：系小子，失丈夫，捡了芝麻丢了西瓜。", "三爻：系丈夫，失小子，舍弃小利保大局。", "四爻：随有获，贞凶，虽有斩获但存在隐患。", "五爻：孚于嘉，吉，信任正确的趋势，大吉。", "上爻：拘系之，乃从维之，财运被套牢，难以脱身。"]
  },
  "75": {
    "name": "山风蛊",
    "fortune": "财运：振疲起衰，需要清理坏账或整顿业务。",
    "lines": ["初爻：干父之蛊，继承家业或处理遗留问题。", "二爻：干母之蛊，不可太生硬，委婉理财。", "三爻：干父之蛊，小有悔，操作稍急但无大碍。", "四爻：裕父之蛊，对亏损坐视不管，凶。", "五爻：干父之蛊，用誉，理财得当，获得名声。", "上爻：不事王侯，高尚其事，不看重小利，追求稳健。"]
  },
  "82": {
    "name": "地泽临",
    "fortune": "财运：教民保民，好运将至，财运正在转好。",
    "lines": ["初爻：咸临，贞吉，感应到财气，操作顺利。", "二爻：咸临，吉无不利，财运亨通。", "三爻：甘临，无攸利，被蝇头小利迷惑，无收获。", "四爻：至临，无咎，亲力亲为理财则吉。", "五爻：知临，大君之宜，智慧投资，大吉。", "上爻：敦临，吉，厚道待人，财运长久。"]
  },
  "58": {
    "name": "风地观",
    "fortune": "财运：观下瞻上，静观其变，不宜急于入市。",
    "lines": ["初爻：童观，见识浅薄，不宜大额操作。", "二爻：闚观，利女贞，视角局限，适合短线。", "三爻：观我生，进退，根据自身盈亏决定进退。", "四爻：观国之光，利用宾于王，利于大盘股。", "五爻：观我生，君子无咎，反省自身投资习惯。", "上爻：观其生，志未平，观察整体环境再做决定。"]
  },
  "34": {
    "name": "火雷噬嗑",
    "fortune": "财运：刚柔相济，需要排除障碍，利于诉讼得财。",
    "lines": ["初爻：屦校灭趾，小惩大诫，损失轻微。", "二爻：噬肤灭鼻，无咎，操作虽然大胆但无害。", "三爻：噬腊肉，遇毒，处理旧账时遇到麻烦。", "四爻：噬干胏，得金矢，利于艰苦求财，有收获。", "五爻：噬干肉，得黄金，财运好，但过程波折。", "上爻：何校灭耳，凶，因贪婪不守规矩而大败。"]
  },
  "73": {
    "name": "山火贲",
    "fortune": "财运：饰外扬质，适合小额投资，包装能获利。",
    "lines": ["初爻：贲其趾，舍车而徒，脚踏实地，不追求奢华。", "二爻：贲其须，随人进退，适合跟单操作。", "三爻：贲如濡如，财运滋润，平稳获利。", "四爻：贲如皤如，白马翰如，会有意外的合作机会。", "五爻：贲于丘园，束帛戋戋，财源虽小但可持续。", "上爻：白贲，无咎，回归质朴，平稳收官。"]
  },
  "78": {
    "name": "山地剥",
    "fortune": "财运：顺势而止，运势极差，资产面临缩水风险。",
    "lines": ["初爻：剥床以足，财基动摇，危险信号。", "二爻：剥床以辨，风险逼近，立刻止损。", "三爻：剥之无咎，在恶劣环境中保持独立。", "四爻：剥床以肤，凶，灾祸临头，无法幸免。", "五爻：贯鱼，以宫人宠，靠裙带关系获利。", "上爻：硕果不食，大势反转，守住最后的火种。"]
  },
  "84": {
    "name": "地雷复",
    "fortune": "财运：寓动于顺，谷底反弹，财运正在回升。",
    "lines": ["初爻：不远复，无祗悔，微调操作即可重回正轨。", "二爻：休复，吉，顺应趋势回归，大吉。", "三爻：频复，厉，反复波动的行情，操作辛苦。", "四爻：中行独复，不盲从大众，独自获利。", "五爻：敦复，无悔，坚定的回归计划。", "上爻：迷复，凶，错过反转时机，财运走低。"]
  },
  "14": {
    "name": "天雷无妄",
    "fortune": "财运：无妄而得，不期而遇的收获，切忌贪心。",
    "lines": ["初爻：无妄往吉，按本心操作即可获利。", "二爻：不耕获，不菑畬，不计较回报反而有大财。", "三爻：无妄之灾，会有意外的亏损（如政策风险）。", "四爻：可贞，无咎，守住自己的立场，不被干扰。", "五爻：无妄之疾，勿药有喜，小亏损不用急，会好转。", "上爻：无妄行有眚，时机不对，多动多错。"]
  },
  "71": {
    "name": "山天大畜",
    "fortune": "财运：止而不止，积蓄丰厚，利于大规模投资。",
    "lines": ["初爻：有厉，利已，有风险，应停止进攻。", "二爻：舆说輹，车轴脱落，虽然想动但环境不许。", "三爻：良马逐，利艰贞，通过竞争获得巨大利润。", "四爻：童牛之牐，元吉，在风险发生前将其化解。", "五爻：豮豕之牙，吉，不战而屈人之兵，轻松获利。", "上爻：何天之衢，亨，财路大开，无往不利。"]
  },
  "74": {
    "name": "山雷颐",
    "fortune": "财运：纯正以养，自食其力，关注大健康或食品股。",
    "lines": ["初爻：舍尔灵龟，观我朵颐，羡慕他人而失去主见。", "二爻：颠颐，拂经，违背规律求财，凶。", "三爻：拂颐，贞凶，不务正业，财运受损。", "四爻：颠颐吉，寻求外部支持以养活项目。", "五爻：拂经，居贞吉，守在原地不要轻易跨界。", "上爻：由颐，厉吉，虽然身担重任，但财运极旺。"]
  },
  "25": {
    "name": "泽风大过",
    "fortune": "财运：非常行动，压力巨大，需寻找支撑点。",
    "lines": ["初爻：藉用白茅，理财极其谨慎，万无一失。", "二爻：枯杨生稊，老夫得其女妻，枯木逢春。", "三爻：栋桡，凶，负担太重，资产面临崩盘。", "四爻：栋隆，吉，获得强力支撑，转危为安。", "五爻：枯杨生华，老妇得其士夫，虚假繁荣。", "上爻：过涉灭顶，凶，盲目冒进导致彻底失败。"]
  },
  "66": {
    "name": "坎为水",
    "fortune": "财运：行险用险，环境险恶，重重困难。",
    "lines": ["初爻：习坎，入于坎窞，陷入重围，难以自拔。", "二爻：坎有险，求小得，在逆境中求取微利。", "三爻：来之坎坎，险且枕，进退两难，宜守。", "四爻：樽酒簋贰，约以纳约，简化生活，减少支出。", "五爻：坎不盈，祗既平，困难将要过去，趋向平稳。", "上爻：系用徽纆，置于丛棘，财务被完全套死。"]
  },
  "33": {
    "name": "离为火",
    "fortune": "财运：附和依托，财源广进，但需防虚火过旺。",
    "lines": ["初爻：履错然，复之无咎，刚入市时步履仓促，调整方向即可。", "二爻：黄离，元吉，获得正财，财运中庸且平稳。", "三爻：日昃之离，夕阳之景，财运将转衰，不宜久留。", "四爻：突如来如，意外的支出或突发性的市场冲击。", "五爻：出涕沱若，戚嗟若，先损后得，忧虑之后有喜。", "上爻：王用出征，利获宝，大动作会有大收获。"]
  },
  "27": {
    "name": "泽山咸",
    "fortune": "财运：相互感应，适合跨界投资，关注消费板块。",
    "lines": ["初爻：咸其拇，感应尚浅，还在观望阶段。", "二爻：咸其腓，凶，急于跟风进场，会有损失。", "三爻：咸其股，随人进退，失去主见是大忌。", "四爻：贞吉悔亡，憧憧往来，专注自己的判断则吉。", "五爻：咸其脢，感应不够深刻，财运平淡。", "上爻：咸其辅颊舌，只说不做，光有计划无行动。"]
  },
  "45": {
    "name": "雷风恒",
    "fortune": "财运：恒心有成，适合长线布局，不宜短线频繁交易。",
    "lines": ["初爻：浚恒，贞凶，过早追求高额利润反而不利。", "二爻：悔亡，持之以恒，财运自然转好。", "三爻：不恒其德，操盘情绪化，容易招致损失。", "四爻：田无禽，方法不对，再怎么守也没收益。", "五爻：恒其德，贞，主妇吉，坚持目前的稳健策略。", "上爻：振恒，凶，心神不宁，频繁调仓会导致大败。"]
  },
  "17": {
    "name": "天山遁",
    "fortune": "财运：遁世救世，运势转弱，此时撤退是最高明的选择。",
    "lines": ["初爻：遁尾，厉，撤退得太晚，处于危险边缘。", "二爻：执之用黄牛之革，财运被死死锁住，难以变现。", "三爻：系遁，有疾厉，撤退不果断，因私情被拖累。", "四爻：好遁，君子吉，潇洒离场，保住利润。", "五爻：嘉遁，贞吉，在最完美的时机高位套现。", "上爻：肥遁，无不利，远离是非之地，资产非常安全。"]
  },
  "41": {
    "name": "雷天大壮",
    "fortune": "财运：壮勿妄动，力量强劲，但要防止因冲动而追高。",
    "lines": ["初爻：壮于趾，征凶，根基不稳就强行进攻，必败。", "二爻：贞吉，守正而不妄动，财运自然亨通。", "三爻：小人用壮，君子用罔，切忌满仓硬拼。", "四爻：藩决不羸，阻碍消失，行情将大爆发。", "五爻：丧羊于易，无悔，失去一些小利反而更安全。", "上爻：羝羊触藩，不能退不能遂，资金被开死。"]
  },
  "38": {
    "name": "火地晋",
    "fortune": "财运：求进发展，财运步步高升，利于展示和推广。",
    "lines": ["初爻：晋如摧如，刚开始受阻，保持信心则吉。", "二爻：晋如愁如，由于担心而犹豫，终会获得重利。", "三爻：众允，悔亡，获得大众认可，行情看好。", "四爻：晋如鼫鼠，贞厉，行为不正（如内幕交易）会有险。", "五爻：悔亡，失得勿恤，不要计较一时得失，大吉。", "上爻：晋其角，利用征邑，虽有小利但已到尽头。"]
  },
  "83": {
    "name": "地火明夷",
    "fortune": "财运：晦而转明，财运受损，宜收敛光芒，静待黑暗过去。",
    "lines": ["初爻：明夷于飞，垂其翼，行情大跌，宜迅速离场远行。", "二爻：明夷，夷于左股，受了点轻伤，但仍能维持。", "三爻：明夷于南狩，得其大首，意外抓到大反弹。", "四爻：入于左腹，获明夷之心，看穿了市场的阴谋。", "五爻：箕子之明夷，利用贞，身处逆境而内心坚定。", "上爻：不明晦，初登于天，后入于地，高台跳水，凶。"]
  },
  "53": {
    "name": "风火家人",
    "fortune": "财运：诚威治业，利于家族企业或内需、家居产业。",
    "lines": ["初爻：闲有家，悔亡，初期建立好规矩则无忧。", "二爻：无攸遂，在中馈，守住内部基本盘，不宜外扩。", "三爻：家人嗃嗃，管教过严，虽有小怨但财不散。", "四爻：富家，大吉，资产稳步增长，家底丰厚。", "五爻：王假有家，勿恤吉，领导力强，财源广进。", "上爻：有孚威如，终吉，靠信用和威望赢得长期红利。"]
  },
  "32": {
    "name": "火泽睽",
    "fortune": "财运：异中求同，意见分歧大，适合小额或另类投资。",
    "lines": ["初爻：悔亡，丧马勿逐，丢掉的小钱不要去追，自会回来。", "二爻：遇主于巷，无咎，非正式渠道会有意外惊喜。", "三爻：见舆曳，其牛掣，阻力重重，非常艰难。", "四爻：睽孤，遇元夫，孤独时遇到贵人相助。", "五爻：悔亡，厥宗噬肤，内部矛盾解决，获利可期。", "上爻：先张之弧，后说之弧，虚惊一场，最终是好消息。"]
  },
  "67": {
    "name": "水山蹇",
    "fortune": "财运：险阻在前，财路不通，利于往西南方向寻求转机。",
    "lines": ["初爻：往蹇来誉，前进有难，退守反而获得名誉。", "二爻：王臣蹇蹇，匪躬之故，为了公事而奔波，利微。", "三爻：往蹇来反，不要硬闯，回归老本行则吉。", "四爻：往蹇来连，联合他人共同应对困局。", "五爻：大蹇朋来，极度困难时，盟友会带钱来救场。", "上爻：往蹇来硕，吉，苦尽甘来，终获巨大利润。"]
  },
  "46": {
    "name": "雷水解",
    "fortune": "财运：柔道致治，困难化解，财运开始流动、解套。",
    "lines": ["初爻：无咎，刚脱离困境，暂时休整。", "二爻：田获三狐，得黄矢，不仅解套还能额外获利。", "三爻：负且乘，致寇至，财物外露招人嫉妒或盗抢。", "四爻：解而拇，朋至斯孚，切断小人联系，大资金会来。", "五爻：君子维有解，吉，有能力的管理者带来了生机。", "上爻：公用射隼于高墉之上，清除了最后的获利障碍。"]
  },
  "72": {
    "name": "山泽损",
    "fortune": "财运：损益制衡，先损后益，此时的让利是为了未来的大赚。",
    "lines": ["初爻：酌损之，无咎，适当减少仓位是明智的。", "二爻：利贞，征凶，弗损益之，保持现状就是最好的。 ", "三爻：三人行则损一人，不宜多人合伙，容易分歧。", "四爻：损其疾，使遄有喜，减掉亏损的项目，会有喜事。", "五爻：或益之十朋之龟，财运极佳，会有巨额收益。", "上爻：弗损益之，无咎，大获全胜，惠及他人。"]
  },
  "54": {
    "name": "风雷益",
    "fortune": "财运：损上益下，大吉大利，适合积极进取、扩大规模。",
    "lines": ["初爻：利用为大作，元吉，适合开启大项目、大单交易。", "二爻：或益之十朋之龟，不期而至的好运，财富暴涨。", "三爻：益之用凶事，无咎，在动荡的市场中反而获利。", "四爻：中行，告公从，利用公信力或官方利好获利。", "五爻：有孚惠心，勿问元吉，以诚待人，财富自来。", "上爻：莫益之，或击之，贪得无厌会有危险。"]
  },
  "21": {
    "name": "泽天夬",
    "fortune": "财运：决而能和，面临决战，需果断处置，不宜拖延。",
    "lines": ["初爻：壮于前趾，往不胜为吝，急于求成会吃亏。", "二爻：惕号，莫夜有戎，勿恤，保持警惕则无大碍。", "三爻：壮于頄，有凶，独行遇雨，虽有波折但无大害。", "四爻：闻言不信，固执己见会导致错失止损良机。", "五爻：苋陆夬夬，中行无咎，像铲除杂草一样果断减仓。", "上爻：无号，终有凶，好运耗尽，必须要彻底离场。"]
  },
  "15": {
    "name": "天风姤",
    "fortune": "财运：天下有风，意外相遇，防范阴暗面的风险（如做空）。",
    "lines": ["初爻：系于金柅，贞吉，发现苗头立即止步则吉。", "二爻：包有鱼，无咎，意外的小财，不宜张扬。", "三爻：臀无肤，其行次且，想动却动不了，被套。 ", "四爻：包无鱼，起凶，由于脱离群众而导致财运枯竭。", "五爻：以杞包瓜，含章，保护好核心资产，会有惊喜。", "上爻：姤其角，吝，机会已经错过去，此时入场没肉吃。"]
  },
  "28": {
    "name": "泽地萃",
    "fortune": "财运：荟萃聚集，利于资源整合、并购或热门板块。",
    "lines": ["初爻：若号，一握为笑，初期混乱，沟通后获利。", "二爻：引吉无咎，被贵人拉一把，财运顺遂。", "三爻：萃如嗟如，无攸利，想挤进热门圈子却没位置。", "四爻：大吉无咎，位居高位且能聚财。", "五爻：萃有位，无咎，通过自身的地位和实力获利。", "上爻：赍咨涕洟，无咎，因局势变化而忧虑，但不亏。"]
  },
  "85": {
    "name": "地风升",
    "fortune": "财运：柔顺谦虚，稳步上升，关注低位缓慢起步的股票。",
    "lines": ["初爻：允升，大吉，获得上方的认可，上涨空间打开。", "二爻：孚乃利用禴，无咎，心诚则灵，小投入大回报。", "三爻：升虚邑，无所疑，前方没有阻力，一路畅通。", "四爻：王用亨于岐山，吉，财运进入高峰期。", "五爻：贞吉，升阶，循序渐进，资产级别提升。", "上爻：冥升，利于不息之贞，盲目上涨，需保持清醒。"]
  },
  "26": {
    "name": "泽水困",
    "fortune": "财运：困境求通，资金周转极其困难，宜守不宜动。",
    "lines": ["初爻：臀困于株木，入于幽谷，长期被套，不见天日。", "二爻：困于酒食，虽然生活无忧，但事业难以施展。", "三爻：困于石，据于蒺藜，进退维谷，极其痛苦。", "四爻：来徐徐，困于金车，吝，救援来得很慢。", "五爻：劓刖，困于赤绂，受政策或上层限制，财运受阻。", "上爻：困于葛藟，曰动悔有悔，困难将尽，准备反弹。"]
  },
  "65": {
    "name": "水风井",
    "fortune": "财运：求贤若渴，财源稳定但不可枯竭，关注公用事业。",
    "lines": ["初爻：井泥不食，资产闲置，没有收益。", "二爻：井谷射鲋，瓮敝漏，投资方向错误，只能赚小钱。", "三爻：井渫不食，为我心恻，有实力但被市场埋没。", "四爻：井甃，无咎，正在修整和加固财务体系。", "五爻：井冽寒泉食，财运极佳，源源不断地获利。", "上爻：井收勿幕，有孚元吉，财富完全公开共享。"]
  },
  "23": {
    "name": "泽火革",
    "fortune": "财运：顺天应人，面临大的改革、转型，不破不立。",
    "lines": ["初爻：巩用黄牛之革，时机未到，应加强自我约束。", "二爻：巳日乃革之，征吉，时机成熟，大胆进行转型。", "三爻：革言三就，有孚，经过反复讨论后的决策最稳。", "四爻：悔亡，有孚改命，吉，彻底改变颓势，大吉。", "五爻：大人虎变，未占有孚，领导层的大动作带来暴利。", "上爻：君子豹变，小人革面，行情末端，微调即可。"]
  },
  "35": {
    "name": "火风鼎",
    "fortune": "财运：稳重图变，三足鼎立，财运稳固，利于餐饮或科创。",
    "lines": ["初爻：鼎颠趾，利出否，清除旧的坏账利于迎接新财。", "二爻：鼎有实，慎所之，有真材实料，防人嫉妒。", "三爻：鼎耳革，其行塞，沟通不畅导致获利受阻。", "四爻：鼎折足，覆公餗，风险爆发，仓位崩溃，大凶。", "五爻：鼎黄耳金铉，贞利，处于最核心的获利位置。", "上爻：鼎玉铉，大吉，财运极其圆满，且有名望。"]
  },
  "44": {
    "name": "震为雷",
    "fortune": "财运：临危不乱，波动极剧烈，大起大落。",
    "lines": ["初爻：震来虩虩，后笑言哑哑，惊吓过后是大利。", "二爻：震来厉，亿丧贝，跻于九陵，大跌时先避险。", "三爻：震苏苏，震行无眚，被行情吓到，但只要动起来就没事。", "四爻：震遂泥，行情陷入泥潭，反应迟钝。", "五爻：震往来厉，意无丧，有事，虽然波动但没损失。", "上爻：震索索，视矍矍，征凶，极度恐惧，宜空仓。"]
  },
  "77": {
    "name": "艮为山",
    "fortune": "财运：动静适时，止步不前，此时最宜持币观望。",
    "lines": ["初爻：艮其趾，无咎，利永贞，一开始就停下，最安全。", "二爻：艮其腓，不拯其随，其心不快，被迫停止。", "三爻：艮其限，列其夤，厉薰心，强行止住导致内心焦虑。", "四爻：艮其身，无咎，修身养性，对波动视而不见。", "五爻：艮其辅，言有序，悔亡，说话谨慎，理财有方。", "上爻：敦艮，吉，敦厚且坚定的停止，大吉。"]
  },
  "57": {
    "name": "风山渐",
    "fortune": "财运：渐进蓄德，像高山上的树木，缓慢而持久地增长。",
    "lines": ["初爻：鸿渐于干，小子厉，初期有小风险，无大碍。", "二爻：鸿渐于磐，饮食衎衎，吉，财运非常安稳舒适。", "三爻：鸿渐于陆，夫征不复，贪功冒进会导致破财。", "四爻：鸿渐于木，或得其桷，找到稳固的避风港或支撑。", "五爻：鸿渐于陵，妇三岁不孕，终莫之胜，长期持有的胜利。", "上爻：鸿渐于陆，其羽可用为仪，功成名就，利留后世。"]
  },
  "42": {
    "name": "雷泽归妹",
    "fortune": "财运：立家兴业，但名不正言不顺，防范投机风险。",
    "lines": ["初爻：归妹以娣，跛能履，地位低但能勉强获利。", "二爻：眇能视，利幽人之贞，坚持孤独的判断则吉。", "三爻：归妹以须，反归以娣，屈就于不利条件之下。", "四爻：归妹愆期，迟归有时，财运晚到，需等待。", "五爻：帝乙归妹，其君之袂不如其娣之袂，低调获利。", "上爻：女承筐无实，士刲羊无血，一场空欢喜。"]
  },
  "43": {
    "name": "雷火丰",
    "fortune": "财运：日中则斜，处于巅峰，警惕随之而来的衰落。",
    "lines": ["初爻：遇其配主，虽旬无咎，找到旗够相当的伙伴。", "二爻：丰其蔀，日中见斗，环境昏暗，被流言遮蔽。", "三爻：丰其沛，日中见昧，折其右肱，主力受损，凶。", "四爻：丰其蔀，日中见斗，遇其夷主，吉，重见天日。", "五爻：来章，有庆誉，吉，吸引人才和资本，大吉。", "上爻：丰其屋，蔀其家，窥其户，寂其无人，彻底崩盘。"]
  },
  "37": {
    "name": "火山旅",
    "fortune": "财运：依义顺时，流动性大，适合差旅、贸易或短线操作。",
    "lines": ["初爻：旅琐琐，斯其所取灾，因计较小利而招灾。", "二爻：旅即次，怀其资，得童仆贞，财物安全，有人帮忙。", "三爻：旅焚其次，丧其童仆，财破人散，极其危险。", "四爻：旅于处，得其资斧，我心不快，虽有钱但不安。", "五爻：射雉，一矢亡，终以誉命，付出一点代价换大名利。", "上爻：鸟焚其巢，旅人先笑而后号咷，丧牛于易，大败。"]
  },
  "55": {
    "name": "巽为风",
    "fortune": "财运：谦逊受益，随风潜入，适合小步快跑、多品种布局。",
    "lines": ["初爻：进退，利武人之贞，犹豫不决，需要果断决策。", "二爻：巽在床下，用史巫纷若，借助外部信息求财。", "三爻：频巽，吝，频繁调仓，劳民伤财。", "四爻：悔亡，田获三品，多领域获利，大丰收。", "五爻：贞吉悔亡，无不利，改弦更张后的新财运。", "上爻：巽在床下，丧其资斧，财运尽，且丧失基本盘。"]
  },
  "22": {
    "name": "兑为泽",
    "fortune": "财运：刚内柔外，喜悦获利，关注社交、传媒及娱乐板块。",
    "lines": ["初爻：和兑，吉，和气生财，交易气氛愉快。", "二爻：孚兑，吉，悔亡，诚信带来的财运。", "三爻：来兑，凶，急于求利，反而被骗。", "四爻：商兑，未宁，介疾有喜，在商谈中权衡利弊。", "五爻：孚于剥，有厉，信任了正在缩水的资产，有险。", "上爻：引兑，被行情牵着鼻子走，失去主动权。"]
  },
  "56": {
    "name": "风水涣",
    "fortune": "财运：拯救涣散，资金有流失风险，需重新整合或注资。",
    "lines": ["初爻：用拯救马壮，吉，趁问题还小时迅速救场。", "二爻：涣奔其机，悔亡，找到稳固的支撑点，止损。", "三爻：涣其躬，无悔，舍小我成大我，个人虽然损但局好。", "四爻：涣其群，元吉，打破小圈子，实现跨越式增长。", "五爻：涣汗其大号，大吉，官方重大利好发布，财源开。", "上爻：涣其血，去逖出，无咎，彻底远离危险区域。"]
  },
  "62": {
    "name": "水泽节",
    "fortune": "财运：万物有节，节制支出，合理控制仓位，不宜满仓。",
    "lines": ["初爻：不出户庭，无咎，环境不好，待在家里不操作。", "二爻：不出门庭，凶，错失了已经到来的解套机会。", "三爻：不节若，则嗟若，不加节制操作，必有叹息。", "四爻：安节，亨，享受节制带来的平稳收益。", "五爻：甘节，吉，往有尚，主动节制是甜蜜的收获。", "上爻：苦节，贞凶，悔亡，过度节制导致错失一切。"]
  },
  "52": {
    "name": "风泽中孚",
    "fortune": "财运：诚信立身，凭借信用获利，关注长期信托或品牌。",
    "lines": ["初爻：虞吉，有他不燕，自己有主见则吉，听别人的则乱。", "二爻：鸣鹤在阴，其子和之，好的投资理念会有追随者。", "三爻：得敌，或鼓或罢，行情波动无常，操作疲累。", "四爻：月几望，马匹亡，无咎，放弃小利以追求大目标。", "五爻：有孚挛如，无咎，诚信凝聚了财富。", "上爻：翰音登于天，贞凶，名不副实，虚假繁荣将破。"]
  },
  "74": {
    "name": "雷山小过",
    "fortune": "财运：行动有度，宜下不宜上，适合小额、细节化投资。",
    "lines": ["初爻：飞鸟以凶，盲目向上冲会招致灾祸。", "二爻：过其祖，遇其妣，求大不得求小得。", "三爻：弗过防之，从或戕之，稍不留神就会被收割。", "四爻：无咎，弗过遇之，往厉必戒，保持极度谨慎。", "五爻：密云不雨，自我西郊，看似利好却迟迟不兑现。", "上爻：弗遇过之，飞鸟离之，凶，过度扩张导致毁灭。"]
  }
}